//Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее

Console.Clear();


int number1 = int.Parse(Console.ReadLine()!);

Console.Write("Введите второе число: ");
int number2 = int.Parse(Console.ReadLine()!);

if (number = number1 > number2);

    Console.WriteLine($"Число {number1} > {number2}");

else (number = number2 > number1);

    Console.WriteLine($"Число {number2} > {number1}");
